In [1]:
import pandas as pd

data = {
    'name': ['Bruno', 'Ariana', 'Harry', 'Selena', 'Weeknd'],
    'gender': ['M', 'F', 'M', 'F', 'M'],
    'income': ['low', 'high', 'medium', 'medium', 'medium']
}

df = pd.DataFrame(data)
df

     name gender  income
0   Bruno      M     low
1  Ariana      F    high
2   Harry      M  medium
3  Selena      F  medium
4  Weeknd      M  medium

In [3]:
medium_income = df[df.income == 'medium']
medium_income

     name gender  income
2   Harry      M  medium
3  Selena      F  medium
4  Weeknd      M  medium

In [10]:
medium_income_count = len(medium_income)
medium_income_count

3

In [9]:
total = df.shape[0]
total

5

In [12]:
(medium_income_count/total)*100

60.0